# GetZoom

## Description
Function GetZoom returns the percentage of the zoom factor in the current document view.

```pascal
FUNCTION GetZoom : REAL;
```

```python

def vs.GetZoom():
    return REAL
```

## Remarks
Returns the percentage of the zoom factor in the current view. (100.0 would be the value if no zooming was done).<BR>
<BR>
[sd 8/18/98]

## Version
Availability: from VectorWorks8.0
## Category
* View / Zoom